In [1]:
import numpy as np
import pandas as pd

In [6]:
data=np.random.randint(1,20,10).reshape(5,2)
df=pd.DataFrame(data,columns=["A","B"],index=["a","b","c","d","e"])
df

    A   B
a  18  13
b  12   7
c  16  12
d   4  15
e   3  18

In [7]:
df.describe()

               A          B
count   5.000000   5.000000
mean   10.600000  13.000000
std     6.841053   4.062019
min     3.000000   7.000000
25%     4.000000  12.000000
50%    12.000000  13.000000
75%    16.000000  15.000000
max    18.000000  18.000000

In [10]:
df.transpose().describe()

               a          b          c          d          e
count   2.000000   2.000000   2.000000   2.000000   2.000000
mean   15.500000   9.500000  14.000000   9.500000  10.500000
std     3.535534   3.535534   2.828427   7.778175  10.606602
min    13.000000   7.000000  12.000000   4.000000   3.000000
25%    14.250000   8.250000  13.000000   6.750000   6.750000
50%    15.500000   9.500000  14.000000   9.500000  10.500000
75%    16.750000  10.750000  15.000000  12.250000  14.250000
max    18.000000  12.000000  16.000000  15.000000  18.000000

In [11]:
df.sum()

A    53
B    65
dtype: int64

In [12]:
df.sum(axis=1)

a    31
b    19
c    28
d    19
e    21
dtype: int64

In [13]:
df.mean()

A    10.6
B    13.0
dtype: float64

In [14]:
df.mean(axis=1)

a    15.5
b     9.5
c    14.0
d     9.5
e    10.5
dtype: float64

In [15]:
df.cumsum()

    A   B
a  18  13
b  30  20
c  46  32
d  50  47
e  53  65

In [16]:
df.cumsum(axis=1)

    A   B
a  18  31
b  12  19
c  16  28
d   4  19
e   3  21

In [17]:
df.min()

A    3
B    7
dtype: int32

In [18]:
df.min(axis=1)

a    13
b     7
c    12
d     4
e     3
dtype: int32

In [19]:
df.max()

A    18
B    18
dtype: int32

In [20]:
df.max(axis=1)

a    18
b    12
c    16
d    15
e    18
dtype: int32

In [25]:
data={"name":["A","B","C"],"marks":[78,98,100],"result":["pass","pass","pass"]}
df=pd.DataFrame(data,index=["a","b","c"])
df

  name  marks result
a    A     78   pass
b    B     98   pass
c    C    100   pass

In [27]:
df.drop("a")

  name  marks result
b    B     98   pass
c    C    100   pass

In [28]:
df

  name  marks result
a    A     78   pass
b    B     98   pass
c    C    100   pass

In [29]:
df.drop("a",inplace=True)

In [30]:
df

  name  marks result
b    B     98   pass
c    C    100   pass

In [31]:
df

  name  marks result
b    B     98   pass
c    C    100   pass

In [32]:
data={"name":["A","B","C"],"marks":[78,98,100],"result":["pass","pass","pass"]}
df=pd.DataFrame(data,index=["a","b","c"])
df

  name  marks result
a    A     78   pass
b    B     98   pass
c    C    100   pass

In [33]:
df.drop("name",axis=1,inplace=True)

In [34]:
df

   marks result
a     78   pass
b     98   pass
c    100   pass

In [35]:
data={"name":["A","B","C"],"marks":[78,98,100],"result":["pass","pass","pass"]}
df=pd.DataFrame(data,index=["a","b","c"])
df

  name  marks result
a    A     78   pass
b    B     98   pass
c    C    100   pass

In [36]:
df.drop(["name","result"],axis=1,inplace=True)

In [37]:
df

   marks
a     78
b     98
c    100

In [38]:
data={"name":["Jane","Kane","Sam"],"marks1":[65,85,32],"marks2":[78,90,56],"marks3":[98,65,100]}
df=pd.DataFrame(data)
df

   name  marks1  marks2  marks3
0  Jane      65      78      98
1  Kane      85      90      65
2   Sam      32      56     100

In [39]:
df.sort_values(by="marks2")

   name  marks1  marks2  marks3
2   Sam      32      56     100
0  Jane      65      78      98
1  Kane      85      90      65

In [40]:
df.sort_values(by="marks3",ascending=False)

   name  marks1  marks2  marks3
2   Sam      32      56     100
0  Jane      65      78      98
1  Kane      85      90      65

In [41]:
df.sort_values(by="name")

   name  marks1  marks2  marks3
0  Jane      65      78      98
1  Kane      85      90      65
2   Sam      32      56     100

In [42]:
df.sort_index(ascending=False)

   name  marks1  marks2  marks3
2   Sam      32      56     100
1  Kane      85      90      65
0  Jane      65      78      98

In [43]:
df.sort_index()

   name  marks1  marks2  marks3
0  Jane      65      78      98
1  Kane      85      90      65
2   Sam      32      56     100

In [45]:
data={"name":["a","b","c","d","e"],"age":[23,25,26,34,35],"gender":["M","F","M","F","F"],"marks1":[34,32,50,56,67]}
df=pd.DataFrame(data)
df

  name  age gender  marks1
0    a   23      M      34
1    b   25      F      32
2    c   26      M      50
3    d   34      F      56
4    e   35      F      67

In [47]:
list(df.groupby("gender"))

[('F',
    name  age gender  marks1
  1    b   25      F      32
  3    d   34      F      56
  4    e   35      F      67),
 ('M',
    name  age gender  marks1
  0    a   23      M      34
  2    c   26      M      50)]

In [48]:
df.groupby("gender").sum()

        age  marks1
gender
F        94     155
M        49      84

In [49]:
df.groupby("gender").describe()

         age                                                      marks1  \
       count       mean       std   min    25%   50%    75%   max  count
gender
F        3.0  31.333333  5.507571  25.0  29.50  34.0  34.50  35.0    3.0
M        2.0  24.500000  2.121320  23.0  23.75  24.5  25.25  26.0    2.0


             mean        std   min   25%   50%   75%   max
gender
F       51.666667  17.897858  32.0  44.0  56.0  61.5  67.0
M       42.000000  11.313708  34.0  38.0  42.0  46.0  50.0

In [50]:
df.groupby("gender").max()

       name  age  marks1
gender
F         e   35      67
M         c   26      50

In [51]:
df.groupby("gender")["age"].sum()

gender
F    94
M    49
Name: age, dtype: int64

In [54]:
df.groupby("gender")["age","marks1"].sum()

<ipython-input-54-bd970257f123>:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  df.groupby("gender")["age","marks1"].sum()

        age  marks1
gender
F        94     155
M        49      84

In [55]:
df.groupby("gender").agg(["sum","mean","max","min"])

       age                    marks1
       sum       mean max min    sum       mean max min
gender
F       94  31.333333  35  25    155  51.666667  67  32
M       49  24.500000  26  23     84  42.000000  50  34

In [60]:
data=np.random.random(10).reshape(5,2)
df1=pd.DataFrame(data,columns=["A","B"])
df1

          A         B
0  0.036022  0.263306
1  0.691914  0.735498
2  0.310120  0.487406
3  0.310827  0.572599
4  0.006356  0.650176

In [61]:
data=np.random.random(10).reshape(5,2)
df2=pd.DataFrame(data,columns=["A","B"])
df2

          A         B
0  0.650353  0.804336
1  0.169718  0.816899
2  0.969217  0.828080
3  0.817189  0.462989
4  0.536024  0.287227

In [63]:
pd.concat([df1,df2],ignore_index=True)

          A         B
0  0.036022  0.263306
1  0.691914  0.735498
2  0.310120  0.487406
3  0.310827  0.572599
4  0.006356  0.650176
5  0.650353  0.804336
6  0.169718  0.816899
7  0.969217  0.828080
8  0.817189  0.462989
9  0.536024  0.287227

In [64]:
pd.concat([df1,df2],axis=1)

          A         B         A         B
0  0.036022  0.263306  0.650353  0.804336
1  0.691914  0.735498  0.169718  0.816899
2  0.310120  0.487406  0.969217  0.828080
3  0.310827  0.572599  0.817189  0.462989
4  0.006356  0.650176  0.536024  0.287227

In [65]:
df1

          A         B
0  0.036022  0.263306
1  0.691914  0.735498
2  0.310120  0.487406
3  0.310827  0.572599
4  0.006356  0.650176

In [67]:
pd.concat([df1,pd.DataFrame({"A":[2],"B":[4]})],ignore_index=True)

          A         B
0  0.036022  0.263306
1  0.691914  0.735498
2  0.310120  0.487406
3  0.310827  0.572599
4  0.006356  0.650176
5  2.000000  4.000000

In [68]:
df1

          A         B
0  0.036022  0.263306
1  0.691914  0.735498
2  0.310120  0.487406
3  0.310827  0.572599
4  0.006356  0.650176

In [71]:
df1

          A         B
0  0.036022  0.263306
1  0.691914  0.735498
2  0.310120  0.487406
3  0.310827  0.572599
4  0.006356  0.650176
5  2.000000  6.000000

In [75]:
df1.loc[6]=[8,10]

In [76]:
df1

          A          B
0  0.036022   0.263306
1  0.691914   0.735498
2  0.310120   0.487406
3  0.310827   0.572599
4  0.006356   0.650176
5  2.000000   6.000000
6  8.000000  10.000000

In [79]:
df=pd.DataFrame({"col1":["A","B","A"],"col2":["P","P","Q"],"col3":["X","Y","Z"]})
df

  col1 col2 col3
0    A    P    X
1    B    P    Y
2    A    Q    Z

In [83]:
pd.value_counts(df["col1"])

A    2
B    1
Name: col1, dtype: int64

In [84]:
df["col2"].value_counts()

P    2
Q    1
Name: col2, dtype: int64

In [85]:
df.apply(df.value_counts)

   col1  col2  col3
A   2.0   NaN   NaN
B   1.0   NaN   NaN
P   NaN   2.0   NaN
Q   NaN   1.0   NaN
X   NaN   NaN   1.0
Y   NaN   NaN   1.0
Z   NaN   NaN   1.0

In [86]:
df["col1"].unique()

array(['A', 'B'], dtype=object)

In [88]:
pd.unique(df["col2"])

array(['P', 'Q'], dtype=object)